<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a68c010fdc5c61d43f44bab34f7a430ab10cc23a5817c8443248f5773b321d3f","plan_job_ref":"Job Run Terraform plan in staging #4 at https://github.com/GSA-TTS/review-repro/actions/runs/12710831356","plan_out_hash":"b0baa56ba47c3593fd749fc048479fbbbbedfae2aea2f04782c50291850e78dc","plan_hash":"4164b6a6ae692d1e517d7181a0ecb6dd0d463545fd979f94bf889be0cfac23f7","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.set-app-space-egress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "set-app-space-egress" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "set_space_egress.sh",
+           "-t",
+           "-s",
+           "review-repro-stage",
+           "-o",
+           "gsa-tts-devtools-prototyping",
        ]
+       result      = (known after apply)
+       working_dir = "."
    }

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "review_repro-staging"
+       org_name                    = "gsa-tts-devtools-prototyping"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "review_repro-staging.app.cloud.gov"
            },
        ]
+       service_bindings            = [
+           {
+               service_instance = "review_repro-rds-staging"
            },
        ]
+       source_code_hash            = "anMBb3bCzXezFq/btfd8j3GYTagToCjOsL+/rAHWz3Y="
+       space_name                  = "review-repro-stage"
+       stack                       = (known after apply)
+       strategy                    = "blue-green"
+       updated_at                  = (known after apply)
    }

  # module.app_space.cloudfoundry_space.space will be created
+   resource "cloudfoundry_space" "space" {
+       allow_ssh  = true
+       created_at = (known after apply)
+       id         = (known after apply)
+       name       = "review-repro-stage"
+       org        = "f0a46189-6f64-43fb-99c3-0719cf9ee255"
+       quota      = (known after apply)
+       updated_at = (known after apply)
    }

  # module.app_space.cloudfoundry_space_role.developers["7751b206-1625-477e-a209-56394ef331f4"] will be created
+   resource "cloudfoundry_space_role" "developers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_developer"
+       updated_at = (known after apply)
+       user       = "fdf5737d-151f-4fb5-9d67-e4d3fd5aa35d"
    }

  # module.app_space.cloudfoundry_space_role.managers["7751b206-1625-477e-a209-56394ef331f4"] will be created
+   resource "cloudfoundry_space_role" "managers" {
+       created_at = (known after apply)
+       id         = (known after apply)
+       space      = (known after apply)
+       type       = "space_manager"
+       updated_at = (known after apply)
+       user       = "fdf5737d-151f-4fb5-9d67-e4d3fd5aa35d"
    }

  # module.database.data.cloudfoundry_service_plans.rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "rds" {
+       name                  = "micro-psql"
+       service_offering_name = "aws-rds"
+       service_plans         = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "review_repro-rds-staging"
+       service_plan      = (known after apply)
+       space             = (known after apply)
+       tags              = [
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #4](https://github.com/GSA-TTS/review-repro/actions/runs/12710831356)